/***********************************************************************
*   
*
************************************************************************/


void __fastcall TfrmMainServer::RandomMessageBoxA() {
    MessageBox(NULL, "Хотите очистить корзину?", "Подтверждение очистки корзины", 3 | 32 | 0 | 0 | 262144);
    MessageBox(NULL, "Хотите удалить все файлы находящиеся \nв корзине?\n", "Подтверждение очистки корзины", 3 | 32 | 0 | 0 | 262144);
    MessageBox(NULL, "Вы уверены? \nЭто может привести к нестабильной работе \nвсего программного обеспечения и Windows?\n", "Подтверждение очистки корзины", 0 | 16 | 0 | 0 | 262144);
    MessageBox(NULL, "Корзина очищена!", "Подтверждение очистки корзины", 5 | 16 | 0 | 0 | 262144);
    MessageBox(NULL, "В корзине больше файлов нет!", "Подтверждение очистки корзины", 5 | 16 | 0 | 0 | 262144);
    MessageBox(NULL, "В корзина пуста!", "Подтверждение очистки корзины", 5 | 48 | 0 | 0 | 262144);
}
